In [45]:
import pandas as pd
import numpy as np

In [58]:
df_netting = pd.read_csv('netting_set.csv')

In [52]:
def remove_blanck(df, array_name):
    df[array_name] = df[array_name].apply(lambda x: x.strip())
    return df

def fill_blanck(df, array_name, fill_value):
    df[array_name] = df[array_name].apply(lambda x: fill_value if not x else x)
    return df

In [61]:
remove_blanck(df_netting, 'netting_set_A')
fill_blanck(df_netting,'netting_set_A', 1)

    cp_num  tri_num netting_set_A      netting_set_B
0     1098  AA11010             1
1     1098  AA11020             1
2     9765  AA11030    isd_110A_1
3     9765  AA11040    isd_110A_1
4     9765  AA11050    isd_110A_1
5     7897  AA11060             1
6     1232  AA11070             1
7     7865  AA11080    isd_110B_1         isd_110B_1
8     7865  AA11090    isd_110B_1         isd_110B_1
9     3340  AA11100             1
10    3340  AA11111             1
11    3340  AA11112             1
12    3340  AA11113             1

In [62]:
remove_blanck(df_netting, 'netting_set_B')
fill_blanck(df_netting,'netting_set_B', 1)

    cp_num  tri_num netting_set_A netting_set_B
0     1098  AA11010             1             1
1     1098  AA11020             1             1
2     9765  AA11030    isd_110A_1             1
3     9765  AA11040    isd_110A_1             1
4     9765  AA11050    isd_110A_1             1
5     7897  AA11060             1             1
6     1232  AA11070             1             1
7     7865  AA11080    isd_110B_1    isd_110B_1
8     7865  AA11090    isd_110B_1    isd_110B_1
9     3340  AA11100             1             1
10    3340  AA11111             1             1
11    3340  AA11112             1             1
12    3340  AA11113             1             1

In [51]:
df_netting['netting_set_A'].apply(lambda x: 1 if not x else x)

0              1
1              1
2     isd_110A_1
3     isd_110A_1
4     isd_110A_1
5              1
6              1
7     isd_110B_1
8     isd_110B_1
9              1
10             1
11             1
12             1
Name: netting_set_A, dtype: object

In [49]:
df_netting['netting_set_B'][0].replace('', str(np.NaN))

'nan'